Конфигурация/InformationRegisters/УсловияДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровДоверительногоУправления</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеобходимыеРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоматическаяПролонгация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантСрокаПролонгации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСрокаПролонгации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПролонгации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипИнвестиционногоНалоговогоВычета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнвестиционныхНалоговыхВычетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЧувствительности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаскрытияИнформации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаскрытияИнформацииОКонфликтеИнтересов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаправлениеИспользованияЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияДоговоровДоверительногоУправления/Ext/ManagerModule.bsl
// Проверяет, контролируются ли необходимые расходы по клиенту и виду договора
//
//	Параметры:
//		- СчетДоверительногоУправления 	- счет доверительного управления
//		- Период 						- дата
//
Функция НеобходимыеРасходыКонтролируютсяПоКлиентуИВидуДоговора(Организация, СчетДоверительногоУправления, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Запрос.УстановитьПараметр("Организация", 					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);	
	
	ДатаНачала = ДатаНачалаПримененияКонтроляНеобходимыхРасходовПоКлиентуИВидуДоговора();
	Запрос.УстановитьПараметр("ДатаНачала", 					ДатаНачала);
	
	// Сначала проверим дату последней записи по этому счету ДУ в регистре
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияДоговоровДоверительногоУправленияСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.УсловияДоговоровДоверительногоУправления.СрезПоследних(
		|			&ДатаНачала,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияДоговоровДоверительногоУправленияСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДатаПроверки = ?(Выборка.Следующий(), ?(Выборка.Период > Период, Период, ДатаНачала), Период);				
		
	ПоместитьДоговорыСКонтролемНеобходимыхРасходовПоКлиентуИВидуДоговораВМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц, Организация, ДатаПроверки);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СчетаДУСКонтролемПоКлиентуИВидуДоговора.Ссылка КАК Ссылка
		|ИЗ
		|	_СчетаДУСКонтролемПоКлиентуИВидуДоговора КАК _СчетаДУСКонтролемПоКлиентуИВидуДоговора
		|ГДЕ
		|	_СчетаДУСКонтролемПоКлиентуИВидуДоговора.Ссылка = &СчетДоверительногоУправления";	
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Помещает счета доверительного управления, неодходимые расходы у которых контролируются в целом по клиенту и виду договора, в менеджер временных таблиц 
// 
// 	Параметры:
//		- МенеджерВременныхТаблиц 	- менеджер временных таблиц
//		- Организация				- организация
// 		- Период					- дата
//		- ИмяВременнойТаблицы		- имя временной таблицы, в которую помещается результат
//
Процедура ПоместитьДоговорыСКонтролемНеобходимыхРасходовПоКлиентуИВидуДоговораВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, Организация, Период, ИмяВременнойТаблицы = "_СчетаДУСКонтролемПоКлиентуИВидуДоговора") Экспорт
		
	Если Период >= ДатаНачалаПримененияКонтроляНеобходимыхРасходовПоКлиентуИВидуДоговора() Тогда
		
		Отбор = Новый Структура("Организация, Клиент, ВидДоговораДоверительногоУправления", Организация, Кэширование.КлиентыГруппыБудущее(), Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
		Справочники.СчетаДоверительногоУправления.ПоместитьДействующиеСчетаДоверительногоУправленияВМенеджерВременныхТаблиц(МенеджерВременныхТаблиц, Период, Отбор, ИмяВременнойТаблицы);
		
	Иначе
		
		ТаблицаКомиссий = Новый ТаблицаЗначений;
		ТаблицаКомиссий.Колонки.Добавить("Ссылка",	Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
				
		СистемныеФункции.ПоместитьТаблицуЗначенийВМенеджерВременныхТаблиц(ТаблицаКомиссий, ИмяВременнойТаблицы, МенеджерВременныхТаблиц); 

	КонецЕсли;
	
КонецПроцедуры

Функция ДатаНачалаПримененияКонтроляНеобходимыхРасходовПоКлиентуИВидуДоговора()
	
	// С 01.01.2024 необходимые расходы по договорам ПН группы Будущее 
	// контролируются не по каждому договору, а по клиенту и виду договора в целом	
	Возврат '20240101';
	
КонецФункции

// Обпределяет, начисляется ли вознаграждение управляющего в базе собственной бухгалтерии (т. е. за счет собственных средств клиента)
//
//	Параметры:
//		- Организация 					- организация
//		- СчетДоверительногоУправления 	- проверяемый счет ДУ
//		- Дата 							- дата проверки
//		- Отказ							- признак отказа
//
Функция ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента(Организация, СчетДоверительногоУправления, Дата, Отказ) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияДоговоровДоверительногоУправленияСрезПоследних.ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента КАК ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента
		|ИЗ
		|	РегистрСведений.УсловияДоговоровДоверительногоУправления.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияДоговоровДоверительногоУправленияСрезПоследних");
	
	Запрос.УстановитьПараметр("Организация", 					Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Дата", 							Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ОплатаВознагражденияУправляющегоИУслугСпецдепозитарияИзСобственныхСредствКлиента;		
	Иначе
					
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для счета ДУ %1 в организации %2 отсутствуют настройки в регистре 'Условия договоров доверительного управления' на дату %3",
																СчетДоверительногоУправления, Организация, Формат(Дата, "ДФ=dd.MM.yyyy")), СчетДоверительногоУправления,,, Отказ); 
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Для вида договора доверительного управления определяет, может ли быть в условиях договора предусмотрена 
// возможность оплаты вознаграждения управляющего и расходов спецдепозитария за счет собственных средств клиента
//
Функция ДляВидаДоговораДУВозможнаОплатаВознагражденияУправляющегоИРасходовСпецдепозитарияИзСобственныхСредствКлиента(ВидДоговораДоверительногоУправления) Экспорт
	
	МассивВидовДоговоров = Новый Массив;
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
	МассивВидовДоговоров.Добавить(Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
	
	Возврат МассивВидовДоговоров.Найти(ВидДоговораДоверительногоУправления) <> Неопределено;
	
КонецФункции
